poloten4ik100/spsvi/STM32L/main.cpp
#include "stm32l1xx.h"
#include "stm32l1xx_gpio.h"
#include "stm32l1xx_usart.h"
#include "stm32l1xx_rcc.h"
#include "stm32l1xx_i2c.h"
#include "stdlib.h"
#include "stdio.h"
#include "string.h"
#include "math.h"

#define SERVO_180 40000
#define SERVO_0 8000

int j=1,l=0;

int servo_angle_pitch = 90;
int pitch_angle = 0;
int servo_angle_roll = 90;
int roll_angle = 0;
int servo_angle_yaw = 90;
int yaw_angle = 0;
int tim_angle_pitch = 3000;
int tim_angle_roll = 3000;
int tim_angle_yaw = 3000;
/*
I2C адресс L3G4200D
HEX: 0x69
int: 105
110100xb, x=1 => SDO лог. 1 => LSB = 1
*/
uint8_t L3G4200D_Address = 0x69;
uint8_t L3G4200D_Address_r = 0xD3; // (1-чтение)
uint8_t L3G4200D_Address_w = 0xD2; 

#define CTRL_REG1 0x20
#define CTRL_REG2 0x21
#define CTRL_REG3 0x22
#define CTRL_REG4 0x23
#define CTRL_REG5 0x24

int16_t x_g;
int16_t y_g;
int16_t z_g;

/*
I2C адресс ADXL345
HEX: 0x53
int: 83
1010011b
*/
uint8_t ADXL345_Address = 0x53;
uint8_t ADXL345_Address_r = 0xA7; // (1-чтение)
uint8_t ADXL345_Address_w = 0xA6;

#define POWER_CTL 0x2D
#define DATA_FORMAT 0x31

int16_t x_a;
int16_t y_a;
int16_t z_a;

/*
I2C адресс Honeywell MC5883L
HEX: 0x1E
*/
uint8_t MC5883L_Address = 0x1E;
uint8_t MC5883L_Address_r = 0x3D; // (1-чтение)
uint8_t MC5883L_Address_w = 0x3C; 

#define ConfigR_A 0x00
#define ConfigR_B 0x01
#define ModeR 0x02

int16_t x_m;
int16_t y_m;
int16_t z_m;

// Данные для анализа в матлабе
uint8_t xa_1;
uint8_t xa_2;
uint8_t ya_1;
uint8_t ya_2;
uint8_t za_1;
uint8_t za_2;

uint8_t xg_1;
uint8_t xg_2;
uint8_t yg_1;
uint8_t yg_2;
uint8_t zg_1;
uint8_t zg_2;

uint8_t xm_1;
uint8_t xm_2;
uint8_t ym_1;
uint8_t ym_2;
uint8_t zm_1;
uint8_t zm_2;

char buf[32]={0};
int counter=0;

// GLOBAL область видимости
  char str[10]; 
  uint8_t data;
  //double servo_angle_pitch_integral = 90;
  //double servo_angle_pitch_pre = 0;
  int32_t servo_res_pitch = 0;
  int32_t servo_res_roll = 0;
  int32_t servo_res_yaw = 0;
  double pitch;
  double roll;
  double pitch_tmp;
  double roll_tmp;
  double yaw;
  double FilterRoll;
  double FilterPitch;
  double FilterYaw;
  //double tmp1 = 0;
  //double tmp2 = 0;
  double zaderzhka = 10; //мс 10^-3 c
  double K = 0.04;
  double angle;
  double Xcal2;  
  double Ycal2;
  double xa,ya,za;
  int f=0;
  
  double PKp = 5; //0.4
  double PKi = 25; //0.0006
  double PKd = 0.0006; //0.005
  double RKp = 5; //0.4
  double RKi = 25; //0.0006
  double RKd = 0.0006; //0.005
  double YKp = 1; //0.4
  double YKi = 0; //0.0006
  double YKd = 0; //0.005
  double error_pitch = 0;
  double pre_error_pitch = 0;
  double integral_pitch = 0;
  double error_roll = 0;
  double pre_error_roll = 0;
  double integral_roll = 0;
  double error_yaw = 0;
  double pre_error_yaw = 0;
  double integral_yaw = 0;


// Функция передачи символа через USART
void Usart_Transmit(uint8_t data)
{
  while(!(USART1->SR & USART_SR_TC)); //Ждем установки флага TC - завершения передачи
  USART1->DR = data;
}

// Функция передачи строки через USART
void Usart_Transmit_str(char* str)
{
  uint8_t i=0;
  while(str[i])
  {
    Usart_Transmit(str[i]);
    i++;
  }
}

void set_pos_servo1(uint8_t pos) 
{
  uint32_t tmp=(SERVO_180 - SERVO_0) /180 ;
  TIM2->CCR2 = SERVO_0 + tmp * pos;
 }

void set_pos_servo2(uint8_t pos) 
{
  uint32_t tmp=(SERVO_180 - SERVO_0) /180 ;
  TIM2->CCR3 = SERVO_0 + tmp * pos;
 }

void set_pos_servo3(uint8_t pos) 
{
  uint32_t tmp=(SERVO_180 - SERVO_0) /180 ;
  TIM2->CCR4 = SERVO_0 + tmp * pos;
 }

void set_pos_servo1_tim(int pos) 
{
  TIM2->CCR2 = pos;
 }

void set_pos_servo2_tim(int pos) 
{
  TIM2->CCR3 = pos;
 }

void set_pos_servo3_tim(int pos) 
{
  TIM2->CCR4 = pos;
 }

GPIO_InitTypeDef GPIO_InitStruct;
USART_InitTypeDef USART_InitStruct;
I2C_InitTypeDef I2C_InitStructure;
NVIC_InitTypeDef NVIC_InitStructure;

void InitUSART(void)
{
  // Инициализация выводов: PA9 - USART1_TX, PA10 - USART1_RX
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE); //Включаем тактирование GPIOА
  // Для выводов PA9, PA10 выбираем альтернативную функцию работы с USART1
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);
  // Инициализации вывода PA10 - USART1_Rx По умолчанию он Input floating
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10; //Настройки вывода PA10
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF; //Режим альтернативной функции
  GPIO_Init(GPIOA, &GPIO_InitStruct); //Заданные настройки сохраняем в регистрах GPIOА
  // Инициализации вывода PA9 - USART1_Tx
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9; //Настройки вывода PA9
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF; //Режим альтернативной функции
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; //Выход Push-Pull
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL; //Выход без подтягивающих резисторов
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_40MHz; //Скорость порта максимальная
  GPIO_Init(GPIOA, &GPIO_InitStruct); //Заданные настройки сохраняем в регистрах GPIOА
  // Инициализация USART1
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE); //Включаем тактирование USART1
  USART_InitStruct.USART_BaudRate = 9600; //Скорость обмена 9600 бод
  USART_InitStruct.USART_WordLength = USART_WordLength_8b; //Длина слова 8 бит
  USART_InitStruct.USART_StopBits = USART_StopBits_1; //1 стоп-бит
  USART_InitStruct.USART_Parity = USART_Parity_No ; //Без проверки четности
  USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None; //Без аппаратного контроля
  USART_InitStruct.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; //Включен передатчик и приемник USART1
  USART_Init(USART1, &USART_InitStruct); //Заданные настройки сохраняем в регистрах USART1
  USART_Cmd(USART1, ENABLE); //Включаем USART1
  
  NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;//0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;//0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

void InitI2C(void)
{
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE); //Включаем тактирование GPIOB
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE); //Включаем тактирование I2C 
  
