poloten4ik100/spsvi/STM32L/main.cpp
      if (data!=0x0D)
      {
        buf[counter]=data; 
        counter++;
      }
        else
      {
        char subStr[3];
        strncpy(subStr, buf+0, 2);
        subStr[2] = 0;
        Usart_Transmit_str(buf+0);
        Usart_Transmit_str("\r\n");
        
        int Num=0;
        Num = atoi(buf);
        //set_pos(Num);
        //TIM2->CCR3 = Num;
        memset(buf, 0, sizeof(buf));
        counter=0;
        Usart_Transmit_str("OK\r\n");
      }
    }*/
     
    //Usart_Transmit(I2C_single_read(ADXL345_Address_w,ADXL345_Address_r,0x00));
 /*   if (f==30){f=0;set_pos_servo1(180);}
    else
    {f++;
    if (f==15) set_pos_servo1(0);
    }*/
    getAccelValues();
    getGyroValues();
    getMagValues();
    
    xa =x_a*0.03125; 
    ya =y_a*0.03125;
    za =z_a*0.03125;
    roll_tmp = atan2(ya ,za);
    pitch_tmp = atan2(xa ,sqrt(za*za + ya*ya));
    roll = (atan2(ya ,za) * 180) / 3.14;
    pitch = (atan2(xa ,sqrt(za*za + ya*ya)) * 180) / 3.14;
    FilterRoll = (1-K)*(FilterRoll+x_g*0.07*0.01)+K*roll;
    FilterPitch = (1-K)*(FilterPitch+(-1)*y_g*0.07*0.01)+K*pitch; //-1
    roll_angle = FilterRoll+90; //-1
    pitch_angle = FilterPitch+90;  
    
    //set_pos_servo1();
    //servo_angle_pitch_integral+=(-1)*(pitch_angle-90)*0.1*10;
    //servo_angle_pitch = servo_angle_pitch_integral + (-1)*(pitch_angle-90)*0;
    //servo_angle_pitch=90-(pitch_angle-90);
    //servo_angle_pitch +=Kp*(0-(pitch_angle-90));
    
    
   error_pitch = 90-pitch_angle;
   if ((servo_res_pitch>=45) && (servo_res_pitch<=180)){
      integral_pitch += error_pitch;
    }
    servo_res_pitch = (int)PKp*error_pitch + PKi*integral_pitch*0.01-PKd*(error_pitch - pre_error_pitch)/0.01;  
    //if (45 <= servo_res_pitch <= 154){
    if ((servo_res_pitch>=45) && (servo_res_pitch<=180))
      set_pos_servo1(servo_res_pitch);
    //}
    pre_error_pitch = error_pitch;
    
  //Usart_Transmit((int)pitch_angle);
    /* Usart_Transmit((int)pitch_angle);
    *//* Usart_Transmit((int)error_pitch);*/
   /*sprintf(str, "%d", (int)pitch_angle ); 
    Usart_Transmit_str(str);
    Usart_Transmit_str(" ");
    sprintf(str, "%d", (int)servo_res_pitch); 
    Usart_Transmit_str(str);
    Usart_Transmit_str(" ");
    sprintf(str, "%d", (int)error_pitch); 
    Usart_Transmit_str(str);
    Usart_Transmit_str("\r\n");*/
    // set_pos_servo2(90);*/
   
   error_roll = 90-roll_angle;
    if ((servo_res_roll>=10) && (servo_res_roll<=170)){
      integral_roll += error_roll;
    }
    servo_res_roll = (int)RKp*error_roll + RKi*integral_roll*0.01+RKd*(error_roll - pre_error_roll)/0.01;  
    if ((servo_res_roll>=10) && (servo_res_roll<=170)){
      set_pos_servo2(servo_res_roll);
    }
    pre_error_roll = error_roll;
    
/*  sprintf(str, "%d", (int)roll_angle ); 
    Usart_Transmit_str(str);
    Usart_Transmit_str(" ");
    sprintf(str, "%d", (int)servo_res_roll); 
    Usart_Transmit_str(str);
    Usart_Transmit_str(" ");
    sprintf(str, "%d", (int)error_roll); 
    Usart_Transmit_str(str);
    Usart_Transmit_str("\r\n");*/
    // не используем
 /*if (roll_angle>90)
    {
      servo_angle_roll++;
      set_pos_servo2(servo_angle_roll);
      //Delay_ms(20);
    } else 
    {
      if (roll_angle<90)
      {
        servo_angle_roll--;
        set_pos_servo2(servo_angle_roll);
        //Delay_ms(20);
      }
    }     */
   
  /* if (pitch_angle>90)
    {
     // tmp1 = pitch_angle - 90;
      servo_angle_pitch--;// servo_angle_pitch - tmp1;
      set_pos_servo1(servo_angle_pitch);
      //Delay_ms(20);
    } else 
    {
      if (pitch_angle<90)
      {
        //tmp2 =  90 + pitch_angle;
        servo_angle_pitch++;//= servo_angle_pitch + tmp2;
        
        set_pos_servo1(servo_angle_pitch);
        //Delay_ms(20);
      }
    }   */ 
  // sprintf(str, "%d", servo_angle_pitch);
  //  Usart_Transmit_str(str); 
    /*
     Usart_Transmit(servo_res_pitch);
    Usart_Transmit(roll_angle);
    Usart_Transmit(roll+90);
    Usart_Transmit(error_pitch);*/
 //   Usart_Transmit('z');*/
     //Usart_Transmit_str("\r\n");
    //sprintf(str, "%f", y_g*0.07 ); 
     //Usart_Transmit_str(str);
    //Usart_Transmit(xg_2);
     //Usart_Transmit_str("\r\n");
    double input_data [3] = {(double)x_m,(double)y_m,(double)z_m};
    transformation(input_data);     
    //Xcal2 = ((double)calibrated_values[0]*0.92)*cos((double)pitch_tmp) + ((double)calibrated_values[1]*0.92)*sin((double)roll_tmp)*sin((double)pitch_tmp) + ((double)calibrated_values[2]*0.92)*cos((double)roll_tmp)*sin((double)pitch_tmp);
    //Ycal2 = ((double)calibrated_values[1]*0.92)*cos((double)roll_tmp) - ((double)calibrated_values[2]*0.92)*sin((double)roll_tmp);
    Xcal2 = ((double)calibrated_values[0]*0.92)*cos((double)pitch_tmp) + ((double)calibrated_values[1]*0.92)*sin(roll_tmp)*sin(pitch_tmp) + ((double)calibrated_values[2]*0.92)*cos(roll_tmp)*sin(pitch_tmp);
    Ycal2 = ((double)calibrated_values[1]*0.92)*cos(roll_tmp) - ((double)calibrated_values[2]*0.92)*sin(roll_tmp);
    angle = atan2( -Ycal2, Xcal2 );
    if (angle < 0) 
    angle += 2*3.14;
    if (angle > 2*3.14)
    angle -= 2*3.14;        
    yaw = (uint16_t)(angle * (180 / 3.14));
    FilterYaw =(1-K)*(FilterYaw+z_g*0.07*(zaderzhka/1000))+K*yaw;
    
    if ((FilterYaw>=0) && (FilterYaw<=180)){
     error_yaw = 90-FilterYaw;
     if ((servo_res_yaw>=0) && (servo_res_yaw<=180)){
      integral_yaw += error_yaw;
    }
    servo_res_yaw = (int)YKp*error_yaw + YKi*integral_yaw*0.01+YKd*(error_yaw - pre_error_yaw)/0.01;  
    if ((servo_res_yaw>=0) && (servo_res_yaw<=180)){
      set_pos_servo3(servo_res_yaw);
    }
    pre_error_yaw = error_yaw;
    }
    

  /*  if (FilterYaw>180)
    {
      servo_angle_yaw--;
      set_pos_servo3(servo_angle_yaw); 
    } else 
    {
      if (FilterYaw<180)
      {
        servo_angle_yaw++;
        set_pos_servo3(servo_angle_yaw);
      }
    } */
   sprintf(str, "%d", (int)FilterYaw ); 
      Usart_Transmit_str(str); 
      Usart_Transmit_str(" "); 
       sprintf(str, "%d", (int)error_yaw ); 
      Usart_Transmit_str(str); 
      Usart_Transmit_str(" "); 
      sprintf(str, "%d", (int)servo_res_yaw); 
      Usart_Transmit_str(str);       
      Usart_Transmit_str("\r\n");

