poloten4ik100/spsvi/STM32L/main.cpp
   /* sprintf(str, "%d ", (int)x_m);
    Usart_Transmit_str(str);
    Usart_Transmit(',');
    sprintf(str, "%d", (int)y_m);
    Usart_Transmit_str(str);
    Usart_Transmit(',');
    sprintf(str, "%d", (int)z_m);
    Usart_Transmit_str(str);
    Usart_Transmit_str("\r\n");/*
    // Вывод калиброваных значений*/
   /* float input_data [3] = {(double)x_m,(double)y_m,(double)z_m};
    transformation(input_data);
    sprintf(str, "%d ", (int)calibrated_values[0]);
    Usart_Transmit_str(str);
    Usart_Transmit(',');
    sprintf(str, "%d", (int)calibrated_values[1]);
    Usart_Transmit_str(str);
    Usart_Transmit(',');
    sprintf(str, "%d", (int)calibrated_values[2]);
    Usart_Transmit_str(str);
    Usart_Transmit_str("\r\n");*/
   Delay_ms(zaderzhka);
    //Отладка в матлабе
   /* Usart_Transmit(xa_1);
    Usart_Transmit(xa_2);
    Usart_Transmit(ya_1);
    Usart_Transmit(ya_2);
    Usart_Transmit(za_1);
    Usart_Transmit(za_2);
    //
    Usart_Transmit(xg_1);  
    Usart_Transmit(xg_2);
    Usart_Transmit(yg_1);  
    Usart_Transmit(yg_2);*/
    /*Usart_Transmit(zg_1);  
    Usart_Transmit(zg_2);
   
    Usart_Transmit(xm_1);  
    Usart_Transmit(xm_2);
    Usart_Transmit(ym_1);  
    Usart_Transmit(ym_2);
    Usart_Transmit(zm_1); 
    Usart_Transmit(zm_2);
    uint8_t data;
    l=0;
    while(!(l==1))
    {
      while(!USART_GetFlagStatus(USART1,USART_FLAG_RXNE)==RESET)
      {
      data=USART_ReceiveData(USART1);
      if (data==0x0D) l=1;
      }
    }*/
   /* int i=0;
   for (i=10;i<170;i++)
   {
     Delay_ms(100);
     set_pos_servo3(i);
   }*/
  }

}
